In [55]:
import numpy as np
import pandas as pd

In [56]:
pd.__version__

'1.5.1'

### New Data: New York City SAT Scores

https://andybek.com/pandas-sat

In [57]:
sat_url = 'https://andybek.com/pandas-sat'

In [58]:
import ssl

ssl._create_default_https_context = ssl._create_unverified_context
sat = pd.read_csv(sat_url)
sat.head(n=5)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.90%,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.90%,Reading,422

In [59]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent Tested      1125 non-null   object
 4   SAT Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: int64(2), object(4)
memory usage: 52.9+ KB

In [60]:
sat['Percent Tested'] = sat['Percent Tested'].replace(regex='%', value='').astype(float)

In [61]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent Tested      1125 non-null   float64
 4   SAT Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 52.9+ KB

In [62]:
sat.head(9)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
5,Abraham Lincoln High School,Brooklyn,2341,54.9,Writing,422
6,Academy for Careers in Television and Film,Queens,515,95.0,Math,444
7,Academy for Careers in Television and Film,Queens,515,95.0,Reading,458
8,Academy for Careers in Television and Film,Queens,515,95.0,Writing,444

In [63]:
sat.set_index(['School Name','SAT Section']).loc[:,['Score']]

                                                        Score
School Name                                SAT Section
A. Philip Randolph Campus High School      Math           459
                                           Reading        453
                                           Writing        447
Abraham Lincoln High School                Math           441
                                           Reading        422
...                                                       ...
Young Women's Leadership School in Astoria Reading        464
                                           Writing        477
Young Women's Leadership School in Queens  Math           415
                                           Reading        420
                                           Writing        433

[1125 rows x 1 columns]

In [64]:
sat.set_index(['School Name','SAT Section']).loc[:,['Score']].unstack(level=1)

                                                   Score
SAT Section                                         Math Reading Writing
School Name
A. Philip Randolph Campus High School                459     453     447
ACORN Community High School                          379     395     385
Abraham Lincoln High School                          441     422     422
Academy for Careers in Television and Film           444     458     444
Academy for College Preparation and Career Expl...   386     397     393
...                                                  ...     ...     ...
World Journalism Preparatory (College Board)         484     491     487
York Early College Academy                           496     481     473
Young Women's Leadership School                      478     465     472
Young Women's Leadership School in Astoria           483     464     477
Young Women's Leadership School in Queens            415     420     433

[375 rows x 3 columns]

In [65]:
sat.head(9)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
5,Abraham Lincoln High School,Brooklyn,2341,54.9,Writing,422
6,Academy for Careers in Television and Film,Queens,515,95.0,Math,444
7,Academy for Careers in Television and Film,Queens,515,95.0,Reading,458
8,Academy for Careers in Television and Film,Queens,515,95.0,Writing,444

In [66]:
# sat.pivot('School Name','SAT Section','Score')

# /var/folders/kz/w63f9yjx2rs32jgdg8wkn4w40000gn/T/ipykernel_4721/3884265074.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
#  sat.pivot('School Name','SAT Section','Score')

In [67]:
sat.pivot(index='School Name', columns='SAT Section', values='Score')

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [68]:
pivoted = sat.pivot(index='School Name', columns='SAT Section', values='Score')

In [69]:
pivoted.head(n=11)

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
Academy for Conservation and the Environment         381      397      390
Academy for Environmental Leadership                 365      366      348
Academy for Health Careers                           406      405      396
Academy for Language and Technology                  371      334      348
Academy for Scholarship and Entrepreneurship (C...   392      408      400
Academy for Social Action (College Board)            357      349      365

# UNDOING PIVOTS

In [70]:
# Q: how do do you 'undo' a pivot?

In [71]:
# the 'cheat':

# scores_by_borough = scores pivoted by brough
# scores_by_school = scores pivoted by school
# enrollment_by_school = enrollment pivoted by shool
# ...

In [72]:
pivoted

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [73]:
pivoted.stack()

School Name                                 SAT Section
A. Philip Randolph Campus High School       Math           459
                                            Reading        453
                                            Writing        447
ACORN Community High School                 Math           379
                                            Reading        395
                                                          ...
Young Women's Leadership School in Astoria  Reading        464
                                            Writing        477
Young Women's Leadership School in Queens   Math           415
                                            Reading        420
                                            Writing        433
Length: 1125, dtype: int64

In [74]:
pivoted.stack().index

MultiIndex([(     'A. Philip Randolph Campus High School',    'Math'),
            (     'A. Philip Randolph Campus High School', 'Reading'),
            (     'A. Philip Randolph Campus High School', 'Writing'),
            (               'ACORN Community High School',    'Math'),
            (               'ACORN Community High School', 'Reading'),
            (               'ACORN Community High School', 'Writing'),
            (               'Abraham Lincoln High School',    'Math'),
            (               'Abraham Lincoln High School', 'Reading'),
            (               'Abraham Lincoln High School', 'Writing'),
            ('Academy for Careers in Television and Film',    'Math'),
            ...
            (                'York Early College Academy', 'Writing'),
            (           'Young Women's Leadership School',    'Math'),
            (           'Young Women's Leadership School', 'Reading'),
            (           'Young Women's Leadership School', 'Writing'),
            ('Young Women's Leadership School in Astoria',    'Math'),
            ('Young Women's Leadership School in Astoria', 'Reading'),
            ('Young Women's Leadership School in Astoria', 'Writing'),
            ( 'Young Women's Leadership School in Queens',    'Math'),
            ( 'Young Women's Leadership School in Queens', 'Reading'),
            ( 'Young Women's Leadership School in Queens', 'Writing')],
           names=['School Name', 'SAT Section'], length=1125)

In [75]:
pivoted.stack().reset_index()

                                     School Name SAT Section    0
0          A. Philip Randolph Campus High School        Math  459
1          A. Philip Randolph Campus High School     Reading  453
2          A. Philip Randolph Campus High School     Writing  447
3                    ACORN Community High School        Math  379
4                    ACORN Community High School     Reading  395
...                                          ...         ...  ...
1120  Young Women's Leadership School in Astoria     Reading  464
1121  Young Women's Leadership School in Astoria     Writing  477
1122   Young Women's Leadership School in Queens        Math  415
1123   Young Women's Leadership School in Queens     Reading  420
1124   Young Women's Leadership School in Queens     Writing  433

[1125 rows x 3 columns]

In [76]:
pivoted.melt()

     SAT Section  value
0           Math    459
1           Math    379
2           Math    441
3           Math    444
4           Math    386
...          ...    ...
1120     Writing    487
1121     Writing    473
1122     Writing    472
1123     Writing    477
1124     Writing    433

[1125 rows x 2 columns]

In [77]:
# the melt() method

In [78]:
pivoted.melt()

     SAT Section  value
0           Math    459
1           Math    379
2           Math    441
3           Math    444
4           Math    386
...          ...    ...
1120     Writing    487
1121     Writing    473
1122     Writing    472
1123     Writing    477
1124     Writing    433

[1125 rows x 2 columns]

In [79]:
pivoted

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [80]:
pivoted.melt().index

RangeIndex(start=0, stop=1125, step=1)

In [81]:
pivoted.reset_index().melt()

      SAT Section                                              value
0     School Name              A. Philip Randolph Campus High School
1     School Name                        ACORN Community High School
2     School Name                        Abraham Lincoln High School
3     School Name         Academy for Careers in Television and Film
4     School Name  Academy for College Preparation and Career Exp...
...           ...                                                ...
1495      Writing                                                487
1496      Writing                                                473
1497      Writing                                                472
1498      Writing                                                477
1499      Writing                                                433

[1500 rows x 2 columns]

In [82]:
pivoted.reset_index().melt(id_vars='School Name')

                                            School Name SAT Section  value
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

In [83]:
pivoted.reset_index().melt(id_vars='School Name').index

RangeIndex(start=0, stop=1125, step=1)

In [84]:
pivoted.reset_index().melt(id_vars='School Name', value_name='Score')

                                            School Name SAT Section  Score
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

# What about Aggregates?

In [85]:
pivoted.head(n=3)

SAT Section                            Math  Reading  Writing
School Name
A. Philip Randolph Campus High School   459      453      447
ACORN Community High School             379      395      385
Abraham Lincoln High School             441      422      422

In [86]:
sat.head(n=3)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447